Функция GetTaskAndUsers(Задача, МассивЮзеров, СоздатьВТрелло, СоздатьВХиггер, ИДУФФ)

	СуществующаяДоска = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   | ВНУТР_ИдДосок.ИдУфф
				   |ИЗ
				   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИдУфф = ИДУФФ Тогда
			СуществующаяДоска = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не СуществующаяДоска Тогда
		Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
		Запись.ИдУфф = ИДУФФ;
		Запись.Записать();
	КонецЕсли;
	Если СоздатьВТрелло Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   | ВНУТР_ИдДосок.ИдУфф,
					   | ВНУТР_ИдДосок.ИдТрелло
					   |ИЗ
					   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИдУФФ = ИДУФФ Тогда
				Если Выборка.ИдТрелло = null Тогда
					
					JSONЗапрос = Новый ЗаписьJSON;
					JSONЗапрос.УстановитьСтроку();
					//ИнтернетПрокси = Новый ИнтернетПрокси(Ложь);
					//ИнтернетПрокси.Установить("https", "proxy", 5558, "antufiev.d.o", "fL9c2WB7", );
					ЗаголовокЗапросаHTTP = Новый Соответствие;
					ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
					АдресРесурса = "/1/boards?key=" + Константы.Key.Получить() + "&token=" + Константы.Token.Получить()
						+ "&name=" + Задача;
					Соединение = Новый HTTPСоединение("api.trello.com", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL); //тут 5 параметром прокси должен быть если работа из офиса
					Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокЗапросаHTTP);
					РезультатЗапроса = Соединение.ВызватьHTTPМетод("POST", Запрос);
					Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
					ПакетСообщения = main.Разобратьпакет(Ответ);
					
					Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
					Запись.ИдУФФ = ИДУФФ;
					Запись.ИдТрелло = null;
					Запись.Прочитать();
					Запись.ИдТрелло = ИДТрелло;
					Запись.Записать();
				Иначе
					//сообщить, что есть такая доска. и не создавать ее
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если СоздатьВХиггер Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   | ВНУТР_ИдДосок.ИдУфф,
					   | ВНУТР_ИдДосок.ИдХиггер
					   |ИЗ
					   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИдУФФ = ИДУФФ Тогда
				Если Выборка.ИдХиггер = null Тогда
					//создаем доску через запрос
					Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
					Запись.ИдУФФ = ИДУФФ;
					Запись.ИдХиггер = null;
					Запись.Прочитать();
					Запись.ИдХиггер = ИДХиггер;
					Запись.Записать();
				Иначе
					//сообщить, что есть такая доска. и не создавать ее
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецФункции