Функция GetTaskAndUsers(Задача, МассивЮзеров, СоздатьВТрелло, СоздатьВХиггер, ИДУФФ)

	СуществующаяДоска = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   | ВНУТР_ИдДосок.ИдУфф
				   |ИЗ
				   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИдУфф = ИДУФФ Тогда
			СуществующаяДоска = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не СуществующаяДоска Тогда
		Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
		Запись.ИдУфф = ИДУФФ;
		Запись.Записать();
	КонецЕсли;
	Если СоздатьВТрелло Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   | ВНУТР_ИдДосок.ИдУфф,
					   | ВНУТР_ИдДосок.ИдТрелло
					   |ИЗ
					   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		КонецЦикла;
	КонецЕсли;
	Если СоздатьВХиггер Тогда
	КонецЕсли;

КонецФункции