Функция GetTaskAndUsers(Задача, МассивЮзеров, СоздатьВТрелло, СоздатьВХиггер, ИДУФФ)

	СуществующаяДоска = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   | ВНУТР_ИдДосок.ИдУфф
				   |ИЗ
				   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИдУфф = ИДУФФ Тогда
			СуществующаяДоска = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не СуществующаяДоска Тогда
		Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
		Запись.ИдУфф = ИДУФФ;
		Запись.Записать();
	КонецЕсли;
	Если СоздатьВТрелло Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   | ВНУТР_ИдДосок.ИдУфф,
					   | ВНУТР_ИдДосок.ИдТрелло
					   |ИЗ
					   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИдУФФ = ИДУФФ Тогда
				Если Выборка.ИдТрелло = null Тогда
					//создаем доску через запрос
					Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
					Запись.ИдУФФ = ИДУФФ;
					Запись.ИдТрелло = null;
					Запись.Прочитать();
					Запись.ИдТрелло = ИДТрелло;
					Запись.Записать();
				Иначе
					//сообщить, что есть такая доска. и не создавать ее
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если СоздатьВХиггер Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   | ВНУТР_ИдДосок.ИдУфф,
					   | ВНУТР_ИдДосок.ИдХиггер
					   |ИЗ
					   | РегистрСведений.ВНУТР_ИдДосок КАК ВНУТР_ИдДосок";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИдУФФ = ИДУФФ Тогда
				Если Выборка.ИдХиггер = null Тогда
					//создаем доску через запрос
					Запись = РегистрыСведений.ВНУТР_ИдДосок.СоздатьМенеджерЗаписи();
					Запись.ИдУФФ = ИДУФФ;
					Запись.ИдХиггер = null;
					Запись.Прочитать();
					Запись.ИдХиггер = ИДХиггер;
					Запись.Записать();
				Иначе
					//сообщить, что есть такая доска. и не создавать ее
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецФункции